#+BEGIN_COMMENT
.. title: Java 8 - Functional Programming
.. slug: java-8-functional-programming
.. date: 2021-12-24 19:36:32 UTC+01:00
.. tags: java, functional-programming, streaming, parallelization
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+begin_export html
<style>
img {
display: block;
margin-top: 60px;
margin-bottom: 60px;
margin-left: auto;
margin-right: auto;
width: 70%;
height: 100%;
class: center;
}

.container {
  position: relative;
  left: 15%;
  margin-top: 60px;
  margin-bottom: 60px;
  width: 70%;
  overflow: hidden;
  padding-top: 56.25%; /* 16:9 Aspect Ratio */
  display:block;
  overflow-y: hidden;
}

.responsive-iframe {
  position: absolute;
  top: 0;
  left: 0;
  bottom: 0;
  right: 0;
  width: 100%;
  height: 100%;
  border: none;
  display:block;
  overflow-y: hidden;
}
</style>
#+end_export

I used to keep these notes together with the general notes on the Java
language.

As that file was growing too big and as functional programming is such
a neat and revolutionizing feature introduced with Java 8, I have
decided to separate the notes in this separate blog entry.

{{{TEASER_END}}}


*** Syntax

    The syntax is very close to the one you know yourself.

    Consider the following    
    
    #+begin_src java :results output raw 
friends.forEach((final String name) -> System.out.println(name));
    #+end_src 

    The forEach() is a higher-order function that /accepts a lambda
    expression/ or block of code to execute in the context of each
    element in the list.

    The variable =name= is bound to each element of the collection
    during the call. So that is the =lambda x= of your python
    code. There you specify what your lambda parameters are. Here you
    specify them within the =()= before the arrow =->=. So that is
    basically the syntax and you already know and love that way of
    programming.

    *Note*: the above is not the only way to implement lambda
    functions in Java. It is nonetheless the most type safe ways of
    doing it.

    Other possible ways involve the following:

    #+begin_src java :results output raw 
friends.forEach((name) -> System.out.println(name));
    #+end_src 

    here you do not specify a type for the name. This is automatically
    inferred by looking at the signature of the called method.

    *Important Note:* We can also use type inference if a lambda
    expression takes multiple parameters, but in that case we must
    leave out the type information for all the parameters; we have to
    *specify the type for none or for all of the parameters* in a lambda
    expression.

    The last way to specify the lambda function is the following:

    #+begin_src java :results output raw 
friends.forEach(name -> System.out.println(name));
    #+end_src

    Note that here you have no =()=. This is a corner case.

    The Java compiler treats single-parameter lambda expressions as
    special: we can leave off the parentheses around the parameter if
    the parameter’s type is inferred. Keep this in mind, cause some of
    your colleagues are using this way of coding.

    *Design choice:* Keep unity in your code and forget about
    it. Always work with =()=e for consistency reasons.

    Note as well the following point in the syntax and the way you
    work with functional programming - i.e. you have to respect the
    logic of the methods. Depeding whether they are static or not you
    pass the lambda argument in different positions. If it is static
    within the class you give it as argument. Otherwise if it is an
    instance method you call the method from it.

    Check at the following simple example with =String= in order to
    properly understand this.

    #+BEGIN_SRC java :results output drawer :classname StaticVsInstance_Method
import java.util.List;
import java.util.ArrayList;

class StaticVsInstance_Method {
    
    public static void main (String args[]){

	List<String> myList = new ArrayList();

	myList.add("romeo");
	myList.add("gatto colosseo");	

	// so note fairly standard the point. respect the logical
	// construct of the language
	myList.stream()
	      .forEach(x -> System.out.println(x.substring(2)));

	myList.stream()
	      .forEach(x -> System.out.println(String.format("Hello %s", x)));

    }

}
    #+END_SRC

    #+RESULTS:
    :results:
    meo
    tto colosseo
    Hello romeo
    Hello gatto colosseo
    :end:
    

**** Don't use Consumer or Predicates - wrap things into Functions

     Note that the one above is a *bad example and not the way to
     write clean code*.

     I.e. you do not want to clutter your memory with static objects
     that you refer to throughout your code.

     So what you do in order to write clean code is the following -
     you wrap the above lambda expressions into lambda functions.

     Check the difference

     #+begin_src java :results output raw :classname CleanCodeFunctional
import java.util.function.Predicate;
import java.util.List;
import java.util.Arrays;

class CleanCodeFunctional {

    public static Predicate<String> checkIfStartsWith(final String letter) {
	return name -> name.startsWith(letter);
    }

    public static void main(String arg[]) {
    
	final List<String> friends =
	    Arrays.asList("Brian", "Nate", "Neal", "Raju", "Sara", "Scott");
	final List<String> editors =
	    Arrays.asList("Brian", "Jackie", "John", "Mike");
	final List<String> comrades =
	    Arrays.asList("Kate", "Ken", "Nick", "Paula", "Zach");

	final long countFriendsStartN =
	    friends.stream()
	    .filter(checkIfStartsWith("N")).count();

	final long countFriendsStartB =
	    friends.stream()
	    .filter(checkIfStartsWith("B")).count();

	System.out.println(String.format("Number starting with N: %d", countFriendsStartN));
	System.out.println(String.format("Number starting with B: %d", countFriendsStartB));	
    }
}
     #+end_src 

     #+RESULTS:
     Number starting with N: 2
     Number starting with B: 1
     Number starting with N: 2
     Number starting with B: 1
     Number starting with N: 2
     Number starting with B: 1
     Number starting with N: 2
     Number starting with B: 1

     Much better and cleaner code is to write the following - function
     wrapper

     #+begin_src java :results output raw 
Function<String, Predicate<String>> StartsWithLetter  =

    (String Letter) -> {

    Predicate<String> checkIfStartsWith = (String name) -> {
	return name -> name.startsWith(Letter);
    }

    return checkIfStartsWith
    }
     #+end_src 

     This can even be written in a more compact way as follows

     #+begin_src java :results output raw 
Function<String, Predicate<String>> StartsWithLetter =
    (String letter) -> (String name) -> name.startsWith(letter);
     #+end_src 

     Note that the above is quite compact notation but it works as the
     compiler will do the necessary job for you in the background.

     This ultimately means that you can write the following
     
     #+begin_src java :results output raw :classname CleanCodeFunctional2
import java.util.function.Function;
import java.util.function.Predicate;
import java.util.List;
import java.util.Arrays;

class CleanCodeFunctional2 {

    public static void main(String arg[]) {
    
	final List<String> friends =
	    Arrays.asList("Brian", "Nate", "Neal", "Raju", "Sara", "Scott");
	final List<String> editors =
	    Arrays.asList("Brian", "Jackie", "John", "Mike");
	final List<String> comrades =
	    Arrays.asList("Kate", "Ken", "Nick", "Paula", "Zach");

	final Function<String, Predicate<String>> checkIfStartsWith =
	    (String letter) -> (String name) -> name.startsWith(letter);	

	final long countFriendsStartN =
	    friends.stream()
	    .filter(checkIfStartsWith.apply("N")).count();

	final long countFriendsStartB =
	    friends.stream()
	    .filter(checkIfStartsWith.apply("B")).count();

	System.out.println(String.format("Number starting with N: %d", countFriendsStartN));
	System.out.println(String.format("Number starting with B: %d", countFriendsStartB));	
    }
}

     #+end_src 

     #+RESULTS:
     Number starting with N: 2
     Number starting with B: 1

*** Method Reference

    As mentioned in the notes regarding the @FunctionalInterface, what
    is important for the functional paradigma is that a
    @FunctionalInterface is implemented.

    So in order to do that you can either use a =lambda= function
    which obviously uses such interface, or you can as well pass a
    /reference to a method where an implementation of a functional
    interface/ is expected.

    Think for instance of =String::toUpperCase=, there a consumer
    method is implicitely implemented, such that the following two
    work in the same way:

    #+begin_src java :results output raw 
// v1
friends.stream()
.map(name -> name.toUpperCase())
.forEach(count -> System.out.print(count + " "));

// v2
friends.stream()
.map(String::toUpperCase)
.forEach(count -> System.out.print(count + " "));
    #+end_src

    Finally, note that method reference is possible, as the target
    object and parameters are derived from the parameters passed to
    the synthesized method. This makes the code with method references
    much more concise than the code with lambda expressions.
    
    *Important:* So note that if lambda functions simply pass the
    parameters through to the method we can replace them always with
    reference methods. If you do some transformation then of course
    that is not possible/ you would have to create a new method for it
    but then it is opinable if that makes sense - i.e. depends on the
    amount of transformation involved.

    This is a nice feature in Java.

    You can find two others examples below.

    You can pass functions to the lambda expressions in the following
    way:

    #+begin_src java :results output raw :classname PassFunction :results drawer
import java.util.List;
import java.util.ArrayList;

class PassFunction {
    public static void main(String arg[]) {
	List<Integer> myList = new ArrayList();

	myList.add(1);
	myList.add(2);
	myList.add(3);
	myList.add(1);
	myList.add(2);
	myList.add(3);

	myList.stream()
	    .forEach(System.out::println);
    }
}		  
    #+end_src 

    #+RESULTS:

    So you see you can pass your functions to the forEach.

    You can even pass your self defined function as paramter

#+begin_src java :results output raw :classname ParamBeh :results drawer
import java.util.List;
import java.util.ArrayList;

class ParamBeh {

    private static int sum = 0;

    public static void main(String arg[]) {

	List<Integer> myList = new ArrayList<>();

	myList.add(1);
	myList.add(2);
	myList.add(3);
	myList.add(1);
	myList.add(2);
	myList.add(3);

	myList.stream()
	      .forEach(x -> {sum = mySum(x, sum);}); // note the nice forEach function.

	System.out.println("final sum is: " + sum);
    }

    private static Integer mySum(Integer x, Integer sum){
	sum += x;

	return sum;


    }    

}		  
#+end_src 

#+RESULTS:
:results:
final sum is: 12
:end:

   You can then pass any function of choice as parameter to your
   lambda functions.

**** Behaviour Parameterization with Nested Functions

     Note that since java 8 there is the =java.util.function=
     package.

     Note that in that package just *interfaces* are defined. This is
     important. Such interfaces implements then the 
    
     Through it, it is possible to write your lambda functions within
     a method that you will then ultimately pass in the method.

     So the question is then if to work in such a way or not and
     rather work with separated methods implemented as above.

     Note that when specifying such functions you should choose from
     one of the interfaces under [[https://docs.oracle.com/javase/8/docs/api/java/util/function/package-summary.html][this url]].

     #+begin_src java :results output raw :classname MyTest
import java.util.List;
import java.util.ArrayList;

class MyTest {

    private static int sum = 0;
    
    public static void main(String arg[]) {


	List<Integer> myList = new ArrayList<>();

	myList.add(1);
	myList.add(2);
	myList.add(3);
	myList.add(1);
	myList.add(2);
	myList.add(3);

	java.util.function.Function<Integer,Integer> MySum = (i) -> {
	    sum += i;
	    return sum;
	};

	myList.stream()
	      .forEach(x -> {sum = MySum.apply((Integer) x);}); // note the nice forEach function.

	System.out.println("final sum is: " + sum);
    }
}
     #+end_src 

     #+RESULTS:
     final sum is: 12


     Note that you can refer to the list
     

*** Nested lambda functions

    This is a nice way of working that you will need to master at some
    point.

    Once you start to properly work via functional programming this
    will come natural.

    Here an example that iterates across all of the hashtables of the
    hashtables and performs operations on them.

    #+begin_src java :results output raw :classname NestedLambda :results drawer
import java.util.List;
import java.util.Map;
import java.util.HashMap;
import java.util.ArrayList;    

class NestedLambda {
    public static void main(String args[]) {
        Map<String, Map<String, Integer>> map = new HashMap<>();

	Map<String, Integer> map2 = new HashMap<>();

	Map<String, Integer> map3 = new HashMap<>();	

	map2.put("a",1); // add the desired value
	map2.put("b",2); // add the desired value
	map2.put("c",3); // add the desired value
	map2.put("d",4); // add the desired value


	map3.put("e",5); // add the desired value
	map3.put("f",6); // add the desired value
	map3.put("g",7); // add the desired value
	map3.put("h",8); // add the desired value	

	map.put("hello", map2);
	map.put("balloon", map3);

 	map.values().stream()
	    .forEach(d -> d.entrySet().stream().forEach(m -> System.out.println(m.getValue())));

	// note d is easily accessible in the second stream
 	map.values().stream()
	    .forEach(d -> d.entrySet().stream().forEach(m -> d.put(m.getKey(), 0 )));	

 	map.values().stream()
	    .forEach(d -> d.entrySet().stream().forEach(m -> System.out.println(m.getValue())));
    }
}
    #+end_src 

    #+RESULTS:
    :results:
    e
    f
    g
    h
    a
    b
    c
    d
    0
    0
    0
    0
    0
    0
    0
    0
    :end:


**** Idea of coupling a callback Interface with Functional Programming

     #+begin_src java :results output raw :classname MyTestFunctional
class MyTestFunctional {

    // public interface
    @FunctionalInterface
    public static interface ICallback {
	public void hello();

	default public void world(){
	    System.out.println("hello world");
	};

    };

    private static void myGenericMethod(ICallback callback, Integer i){
	//consider checking if runnable != null to avoid NPE

	if (i % 2 == 0) 
	    callback.hello();
	else
	    callback.world();
	
    }      
    
    public static void main(String arg[]) {

	Integer i = 0;

	while (i < 5){
	    
	    myGenericMethod(() -> {
		    //do something fancy
		    System.out.println("baubab"); // implements the functional interface
		}, i);

	    i++;
	} 
    }
}

     #+end_src 

     #+RESULTS:
     baubab
     hello world
     baubab
     hello world
     baubab

     Note now that if you are to add a third method in the callback
     above it would not be a functional interface anymore, and you
     could not apply the lambda function logic as here.

